Amiya200/stm32_water_tank/Core/Src/model_handle.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  MODEL HANDLE – FINAL (2025)
 *  ✔ ALL MODES WORKING
 *  ✔ TIMER MODE FIXED
 *  ✔ EEPROM SAFE (RESET PROOF)
 ***************************************************************/

#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"
#include "eeprom_i2c.h"
#include "main.h"          // BUZZER: LED5
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/***************************************************************
 *  EXTERNAL MODULE VARIABLES
 ***************************************************************/
extern ADC_Data adcData;
extern RTC_Time_t time;
extern float g_currentA;
extern float g_voltageV;

/***************************************************************
 * ================= TIMER EEPROM SAFE BLOCK ===================
 ***************************************************************/
#define TIMER_EE_SIGNATURE  0x544D   /* 'TM' */
#define TIMER_EE_VERSION    1
#define EE_ADDR_TIMER_BLOCK 0x1000

typedef struct {
    uint16_t signature;
    uint8_t  version;
    uint8_t  reserved;
    TimerSlot slots[5];
    uint16_t crc;
} TimerEEPROMBlock;

/***************************************************************
 * CRC16 (EEPROM SAFETY)
 ***************************************************************/
static uint16_t Timer_CRC16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFF;
    while (len--) {
        crc ^= *data++;
        for (uint8_t i = 0; i < 8; i++)
            crc = (crc & 1) ? (crc >> 1) ^ 0xA001 : (crc >> 1);
    }
    return crc;
}

/***************************************************************
 * TIMER SLOTS (5)
 ***************************************************************/
TimerSlot timerSlots[5] = {0};

/***************************************************************
 * MODE FLAGS
 ***************************************************************/
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;

/***************************************************************
 * MOTOR STATUS
 ***************************************************************/
volatile uint8_t motorStatus = 0;

/***************************************************************
 * PROTECTION FLAGS
 ***************************************************************/
volatile bool senseDryRun         = false;
volatile bool senseOverLoad       = false;
volatile bool senseUnderLoad      = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;
volatile bool manualOverride      = false;

/* Legacy externs */
volatile uint16_t auto_retry_counter = 0;
volatile bool     countdownMode      = false;
volatile uint32_t countdownDuration  = 0;

/***************************************************************
 * TWIST SETTINGS
 ***************************************************************/
TwistSettings twistSettings;
/***************************************************************
 * ===================== DEVICE SETTINGS =======================
 ***************************************************************/
typedef struct {
    bool    manual_on;
    bool    semi_on;
    bool    timer_on;
    bool    countdown_on;
    bool    twist_on;
    bool    auto_on;
    bool    motor_on;
    uint8_t power_restore_mode; /* 0=YES, 1=NO, 2=LAST */
} ModeState;

static ModeState modeState;

/* Power Restore runtime copy */
static uint8_t powerRestoreMode = 0;

/* System defaults */
SystemSettings sys = {
    .gap_time_s  = 0,
    .retry_count = 0,
    .uv_limit    = 190,
    .ov_limit    = 270,
    .overload    = 0.0f,
    .underload   = 0.0f,
    .maxrun_min  = 300
};
/***************************************************************
 * ========== INTERNAL FORWARD DECLARATIONS (FIX) ==============
 ***************************************************************/

/* Motor helpers */
static inline void start_motor(void);
static inline void stop_motor(void);

/* Mode helpers */
static inline void clear_all_modes(void);
static inline bool isAnyModeActive(void);

/* Dry-run */
void ModelHandle_SoftDryRunHandler(void);

/* Timer helpers */
static bool     timer_any_active_slot(void);
static uint16_t get_active_timer_gap_minutes(void);
static uint8_t  get_today_mask(void);
static bool     slot_is_active_now(const TimerSlot *t);

/* Tank */
static bool isTankFull(void);

/* FSM ticks */
static void auto_tick(void);
static void countdown_tick(void);
static void twist_tick(void);
static void twist_time_logic(void);
static void protections_tick(void);
static void leds_from_model(void);

/***************************************************************
 * ================= EEPROM SETTINGS SAVE ======================
 ***************************************************************/
void ModelHandle_SaveSettingsToEEPROM(void)
{
    EEPROM_WriteBuffer(EE_ADDR_GAP_TIME,    (uint8_t*)&sys.gap_time_s,   sizeof(sys.gap_time_s));
    EEPROM_WriteBuffer(EE_ADDR_RETRY_COUNT, (uint8_t*)&sys.retry_count,  sizeof(sys.retry_count));
    EEPROM_WriteBuffer(EE_ADDR_UV_LIMIT,    (uint8_t*)&sys.uv_limit,     sizeof(sys.uv_limit));
    EEPROM_WriteBuffer(EE_ADDR_OV_LIMIT,    (uint8_t*)&sys.ov_limit,     sizeof(sys.ov_limit));
    EEPROM_WriteBuffer(EE_ADDR_OVERLOAD,    (uint8_t*)&sys.overload,     sizeof(sys.overload));
    EEPROM_WriteBuffer(EE_ADDR_UNDERLOAD,   (uint8_t*)&sys.underload,    sizeof(sys.underload));
    EEPROM_WriteBuffer(EE_ADDR_MAXRUN,      (uint8_t*)&sys.maxrun_min,   sizeof(sys.maxrun_min));

    uint16_t sig = SETTINGS_SIGNATURE;
    EEPROM_WriteBuffer(EE_ADDR_SIGNATURE, (uint8_t*)&sig, sizeof(sig));
}

/***************************************************************
 * ================= EEPROM SETTINGS LOAD ======================
 ***************************************************************/
void ModelHandle_LoadSettingsFromEEPROM(void)
{
    uint16_t sig = 0;
    EEPROM_ReadBuffer(EE_ADDR_SIGNATURE, (uint8_t*)&sig, sizeof(sig));

    if (sig != SETTINGS_SIGNATURE)
    {
        ModelHandle_SaveSettingsToEEPROM();
        return;
    }

    EEPROM_ReadBuffer(EE_ADDR_GAP_TIME,    (uint8_t*)&sys.gap_time_s,   sizeof(sys.gap_time_s));
    EEPROM_ReadBuffer(EE_ADDR_RETRY_COUNT, (uint8_t*)&sys.retry_count,  sizeof(sys.retry_count));
    EEPROM_ReadBuffer(EE_ADDR_UV_LIMIT,    (uint8_t*)&sys.uv_limit,     sizeof(sys.uv_limit));
    EEPROM_ReadBuffer(EE_ADDR_OV_LIMIT,    (uint8_t*)&sys.ov_limit,     sizeof(sys.ov_limit));
    EEPROM_ReadBuffer(EE_ADDR_OVERLOAD,    (uint8_t*)&sys.overload,     sizeof(sys.overload));
    EEPROM_ReadBuffer(EE_ADDR_UNDERLOAD,   (uint8_t*)&sys.underload,    sizeof(sys.underload));
    EEPROM_ReadBuffer(EE_ADDR_MAXRUN,      (uint8_t*)&sys.maxrun_min,   sizeof(sys.maxrun_min));
}

/***************************************************************
 * ================= MODE STATE SAVE ===========================
 ***************************************************************/
void ModelHandle_SaveModeState(void)
{
    modeState.manual_on          = manualActive;
    modeState.semi_on            = semiAutoActive;
    modeState.timer_on           = timerActive;
    modeState.countdown_on       = countdownActive;
    modeState.twist_on           = twistActive;
    modeState.auto_on            = autoActive;
    modeState.motor_on           = (motorStatus == 1);
    modeState.power_restore_mode = powerRestoreMode;

