Amiya200/stm32_water_tank/Core/Src/model_handle.c
    EEPROM_WriteBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));
}

/***************************************************************
 * ================= MODE STATE LOAD ===========================
 ***************************************************************/
void ModelHandle_LoadModeState(void)
{
    EEPROM_ReadBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));

    powerRestoreMode = modeState.power_restore_mode;
    if (powerRestoreMode > 2) powerRestoreMode = 0;

    if (powerRestoreMode == 1) /* NO */
    {
        manualActive = semiAutoActive = countdownActive =
        twistActive  = timerActive = autoActive = false;
        return;
    }

    manualActive    = modeState.manual_on;
    semiAutoActive  = modeState.semi_on;
    timerActive     = modeState.timer_on;
    countdownActive = modeState.countdown_on;
    twistActive     = modeState.twist_on;
    autoActive      = modeState.auto_on;
}

/***************************************************************
 * ================= TIMER EEPROM SAVE (SAFE) =================
 ***************************************************************/
void ModelHandle_SaveTimerToEEPROM(void)
{
    TimerEEPROMBlock blk;
    memset(&blk, 0, sizeof(blk));

    blk.signature = TIMER_EE_SIGNATURE;
    blk.version   = TIMER_EE_VERSION;
    memcpy(blk.slots, timerSlots, sizeof(timerSlots));

    blk.crc = Timer_CRC16((uint8_t*)&blk,
                          sizeof(blk) - sizeof(uint16_t));

    EEPROM_WriteBuffer(EE_ADDR_TIMER_BLOCK,
                       (uint8_t*)&blk,
                       sizeof(blk));
}

/***************************************************************
 * ================= TIMER EEPROM LOAD (SAFE) =================
 ***************************************************************/
void ModelHandle_LoadTimerFromEEPROM(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,
                      (uint8_t*)&blk,
                      sizeof(blk));

    uint16_t crc = Timer_CRC16((uint8_t*)&blk,
                               sizeof(blk) - sizeof(uint16_t));

    if (blk.signature != TIMER_EE_SIGNATURE ||
        blk.version   != TIMER_EE_VERSION   ||
        blk.crc       != crc)
    {
        memset(timerSlots, 0, sizeof(timerSlots));
        return;
    }

    memcpy(timerSlots, blk.slots, sizeof(timerSlots));

    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (t->onHour > 23 || t->offHour > 23 ||
            t->onMinute > 59 || t->offMinute > 59 ||
            t->dayMask == 0)
        {
            memset(t, 0, sizeof(TimerSlot));
        }
    }
}
/***************************************************************
 * ================= INTERNAL UTILITIES ========================
 ***************************************************************/
/***************************************************************
 * ============== FORWARD DECLARATIONS (REQUIRED) ==============
 ***************************************************************/

/* TIMER helpers */
static bool     timer_any_active_slot(void);
static uint16_t get_active_timer_gap_minutes(void);
static uint8_t  get_today_mask(void);
static bool     slot_is_active_now(const TimerSlot *t);

/* Tank level */
static bool     isTankFull(void);

/* Mode helpers */
static inline bool isAnyModeActive(void);

/* FSM ticks */
static void     auto_tick(void);
static void     countdown_tick(void);
static void     twist_tick(void);
static void     twist_time_logic(void);
static void     protections_tick(void);
static void     leds_from_model(void);
/***************************************************************
 * ================= TANK FULL DETECTION ======================
 ***************************************************************/
static bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool allZero = true;

    /* ADC channels 1..5 = tank probes */
    for (int i = 1; i <= 5; i++)
    {
        if (adcData.voltages[i] > 0.10f)
        {
            allZero = false;
            break;
        }
    }

    uint32_t now = HAL_GetTick();

    if (allZero)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }

        if ((now - stableStart) >= 1000)
            return true;
    }
    else
    {
        lastState = false;
    }

    return false;
}
/***************************************************************
 * ============ MISSING PUBLIC API RESTORE ====================
 ***************************************************************/

/* Called from main.c / screen.c */
void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive) return;
    ModelHandle_ProcessTimerSlots();
}

void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}

/* User settings */
uint16_t ModelHandle_GetGapTime(void)        { return sys.gap_time_s; }
uint8_t  ModelHandle_GetRetryCount(void)     { return sys.retry_count; }
uint16_t ModelHandle_GetUnderVolt(void)      { return sys.uv_limit; }
uint16_t ModelHandle_GetOverVolt(void)       { return sys.ov_limit; }
float    ModelHandle_GetOverloadLimit(void)  { return sys.overload; }
float    ModelHandle_GetUnderloadLimit(void) { return sys.underload; }
uint16_t ModelHandle_GetMaxRunTime(void)     { return sys.maxrun_min; }

uint8_t ModelHandle_GetPowerRestoreMode(void)
{
    return powerRestoreMode;
}

void ModelHandle_SetPowerRestoreMode(uint8_t mode)
{
    if (mode > 2) mode = 0;
    powerRestoreMode = mode;
    ModelHandle_SaveModeState();
}

/* Manual */
void ModelHandle_ToggleManual(void)
{
    manualActive = !manualActive;
    if (manualActive) start_motor();
    else stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    ModelHandle_SaveModeState();
}

/* Factory reset */
void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s  = 0;
    sys.retry_count = 0;
    sys.uv_limit    = 190;
    sys.ov_limit    = 270;
    sys.overload    = 0.0f;
    sys.underload   = 0.0f;
    sys.maxrun_min  = 300;

