Amiya200/stm32_water_tank/Core/Src/model_handle.c
    ModelHandle_SaveSettingsToEEPROM();
}

/* Timer helper */
void ModelHandle_StartTimerNearestSlot(void)
{
    clear_all_modes();
    timerActive = true;
    ModelHandle_ProcessTimerSlots();
}
static inline void Buzzer_SetPin(bool on)
{
    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static uint32_t buzzerAlertUntil = 0;

static void Buzzer_TriggerAlert(void)
{
    buzzerAlertUntil = HAL_GetTick() + 30000UL;
}

static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();
    bool motorOn = Motor_GetStatus();
    bool alert   = (now < buzzerAlertUntil);

    static bool buzzerState = false;
    bool newState = false;

    if (alert)
    {
        newState = ((now % 600UL) < 200UL);
    }
    else if (motorOn)
    {
        newState = ((now % 800UL) < 150UL);
    }

    if (newState != buzzerState)
    {
        buzzerState = newState;
        Buzzer_SetPin(buzzerState);
    }
}
/* Reset key (SW1) */
void reset(void)
{
    /* If any protection fault is active, do not attempt reset run */
    if (senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached)
    {
        stop_motor();
        return;
    }

    /* Treat reset as a special manual test — no other modes */
    clear_all_modes();
    manualOverride = true;

    /* 1) Start motor and run up to 5s to check for water (dry-run sensor) */
    start_motor();

    uint32_t start = HAL_GetTick();
    senseDryRun = true;  // assume dry until we see water

    while ((HAL_GetTick() - start) < 5000UL)
    {
        /* Update dry-run status based on sensor voltage */
        ModelHandle_CheckDryRun();

        /* If water is detected (dry-run cleared), break early */
        if (!senseDryRun)
            break;

        HAL_Delay(100);
    }

    /* After 5s: if still dry → stop motor and exit */
    if (senseDryRun)
    {
        stop_motor();
        manualOverride = false;
        Buzzer_TriggerAlert();      // <<< BUZZER: tank empty / dry run
        return;
    }

    /* 2) Water available → keep motor ON until tank is full or fault */
    while (!isTankFull())
    {
        ModelHandle_CheckLoadFault();
        if (senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached)
        {
            stop_motor();
            manualOverride = false;
            Buzzer_TriggerAlert();  // <<< BUZZER: load/volt fault
            return;
        }

        ModelHandle_CheckDryRun();
        if (senseDryRun)
        {
            stop_motor();
            manualOverride = false;
            Buzzer_TriggerAlert();  // <<< BUZZER: dry run while reset
            return;
        }

        HAL_Delay(100);
    }

    /* Tank full → stop motor */
    stop_motor();
    manualOverride = false;
    Buzzer_TriggerAlert();          // <<< BUZZER: tank full
}


static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}

/***************************************************************
 * ================= MOTOR CONTROL =============================
 ***************************************************************/
static uint32_t motorOnStartMs = 0;
static uint32_t powerOnMs     = 0;

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
}

static bool Motor_StartAllowed(void)
{
    return (HAL_GetTick() - powerOnMs) >= 7000UL; /* 7s delay */
}

static inline bool Motor_GetStatusInternal(void)
{
    return (motorStatus == 1);
}

bool Motor_GetStatus(void)
{
    return Motor_GetStatusInternal();
}

static inline void motor_apply(bool on)
{
    bool current = Motor_GetStatusInternal();
    if (on == current)
        return;

    if (on)
    {
        if (!Motor_StartAllowed())
            return;

        motorOnStartMs = HAL_GetTick();
    }

    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;
    UART_SendStatusPacket();
}

static inline void start_motor(void) { motor_apply(true); }
static inline void stop_motor(void)  { motor_apply(false); }

/***************************************************************
 * ================= BUZZER DRIVER =============================
 ***************************************************************/


/***************************************************************
 * ================= MAX RUN PROTECTION ========================
 ***************************************************************/
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus())
        return;

    if (countdownActive)
        return;

    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;
    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        ModelHandle_SaveModeState();
        Buzzer_TriggerAlert();
    }
}

/***************************************************************
 * ================= DRY RUN SENSOR ============================
 ***************************************************************/
void ModelHandle_CheckDryRun(void)
{
    /* Manual, Semi-Auto, Countdown ignore dry-run feature */
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }

    float v = adcData.voltages[0];

    if (v < 0.01f)
        senseDryRun = true;   /* DRY */
    else
        senseDryRun = false;  /* WATER OK */
}


/***************************************************************
 * ================= SOFT DRY RUN FSM ==========================
 ***************************************************************/
#define DRY_PROBE_ON_MS   5000UL
#define DRY_CONFIRM_MS    1500UL

static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;
static uint32_t dryOffGapMs     = 10000UL;

