Amiya200/stm32_water_tank/Core/Src/model_handle.c
    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;

    return (on < off) ? (now >= on && now < off)
                      : (now >= on || now < off);
}

static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    return false;
}

static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;

    uint16_t now = time.hour * 60 + time.min;
    uint8_t  dm  = get_today_mask();

    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;

        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;

        bool active = (on < off) ?
                      (now >= on && now < off) :
                      (now >= on || now < off);

        if (active)
            return t->gapMinutes;
    }
    return 0;
}

/***************************************************************
 * TIMER PROCESS (CALLED EVERY LOOP)
 ***************************************************************/
void ModelHandle_ProcessTimerSlots(void)
{
    if (!timerActive) return;

    ModelHandle_SaveModeState();

    if (timer_any_active_slot())
        start_motor();
    else
        stop_motor();
}

/***************************************************************
 * START / STOP TIMER MODE
 ***************************************************************/
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;
    ModelHandle_SaveTimerToEEPROM();
    ModelHandle_ProcessTimerSlots();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

/***************************************************************
 * AUTO TIMER ACTIVATION
 ***************************************************************/
void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}

/***************************************************************
 * ===================== SEMI AUTO MODE ========================
 ***************************************************************/
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    ModelHandle_SaveModeState();

    senseDryRun = false;
    if (!isTankFull())
        start_motor();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

/***************************************************************
 * ======================== AUTO MODE ==========================
 ***************************************************************/
static uint16_t auto_gap_s       = 10;
static uint16_t auto_maxrun_min  = 12;
static uint8_t  auto_retry_limit = 5;
static uint8_t  auto_retry_count = 0;

typedef enum {
    AUTO_IDLE = 0,
    AUTO_ON_WAIT,
    AUTO_DRY_CHECK,
    AUTO_OFF_WAIT
} AutoState;

static AutoState autoState    = AUTO_IDLE;
static uint32_t  autoDeadline = 0;

void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry)
{
    clear_all_modes();

    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;

    ModelHandle_SaveModeState();
    start_motor();
    autoDeadline = now_ms() + gap_s * 1000UL;
}

void ModelHandle_StopAuto(void)
{
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;

    ModelHandle_SaveModeState();
    stop_motor();
}

static void auto_tick(void)
{
    if (!autoActive) return;

    uint32_t now = now_ms();

    if (isTankFull())
    {
        ModelHandle_StopAuto();
        Buzzer_TriggerAlert();
        return;
    }

    switch (autoState)
    {
        case AUTO_ON_WAIT:
            if (now >= autoDeadline)
                autoState = AUTO_DRY_CHECK;
            break;

        case AUTO_DRY_CHECK:
            ModelHandle_CheckDryRun();
            if (!senseDryRun)
            {
                stop_motor();
                autoState = AUTO_OFF_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
                Buzzer_TriggerAlert();
            }
            else
            {
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
            }
            break;

        case AUTO_OFF_WAIT:
            if (now >= autoDeadline)
            {
                auto_retry_count++;
                auto_retry_counter = auto_retry_count;

                if (auto_retry_limit &&
                    auto_retry_count > auto_retry_limit)
                {
                    ModelHandle_StopAuto();
                    return;
                }

                start_motor();
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
            }
            break;

        default:
            break;
    }
}

/***************************************************************
 * ====================== COUNTDOWN MODE =======================
 ***************************************************************/
static uint32_t cd_deadline = 0;

void ModelHandle_StartCountdown(uint32_t seconds)
{
    clear_all_modes();
    if (seconds == 0) return;

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;

    ModelHandle_SaveModeState();
    start_motor();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    stop_motor();
    ModelHandle_SaveModeState();
}

static void countdown_tick(void)
{
    if (!countdownActive) return;

    uint32_t now = now_ms();

    if (isTankFull())
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }

    if (now < cd_deadline)
        countdownDuration = (cd_deadline - now) / 1000UL;
    else
        ModelHandle_StopCountdown();
}

/***************************************************************
 * ========================= TWIST MODE ========================
 ***************************************************************/
static bool     twist_on_phase = false;
static uint32_t twist_deadline = 0;

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();

    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;

