Amiya200/stm32_water_tank/Core/Src/model_handle.c
    /* Convert stored int16 -> float if system uses float */
    sys.overload  = (float)overload;
    sys.underload = (float)underload;

    sys.maxrun_min = maxrun_min;

    ModelHandle_SaveSettingsToEEPROM();
}

void ModelHandle_SetAutoSettings(uint16_t gap_s,
                                 uint16_t maxrun_min,
                                 uint8_t retry)
{
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;

    EEPROM_WriteBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_WriteBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_WriteBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}

bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}

/***************************************************************
 * ===================== RTC MODE PERSIST ======================
 ***************************************************************/
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;

    RTC_SavePersistentState(&s);
}

/***************************************************************
 * ================= TIMER SLOT SETTER API =====================
 ***************************************************************/
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    if (slot >= 5) return;

    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
}

/***************************************************************
 * ================= PROTECTION ENABLE APIs ====================
 ***************************************************************/
void ModelHandle_SetDryRun(bool on)
{
    sys.gap_time_s = on ? (sys.gap_time_s ? sys.gap_time_s : 10) : 0;
}

void ModelHandle_SetOverLoad(bool on)
{
    sys.overload = on ? (sys.overload > 0.1f ? sys.overload : 9.0f) : 0.0f;
}

void ModelHandle_SetOverUnderVolt(bool on)
{
    if (!on)
    {
        sys.uv_limit = 0;
        sys.ov_limit = 0;
    }
    else
    {
        if (!sys.uv_limit) sys.uv_limit = 190;
        if (!sys.ov_limit) sys.ov_limit = 270;
    }
}

void ModelHandle_ClearMaxRunFlag(void)
{
    senseMaxRunReached = false;
}
/***************************************************************
 * ====== TIMER SLOT READ API (FOR SCREEN) =====================
 ***************************************************************/
const TimerSlot* ModelHandle_GetTimerSlots(void)
{
    return timerSlots;
}

/***************************************************************
 * ================= UART STUB ================================
 ***************************************************************/
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    (void)cmd;
}
